app/controllers/articles_controller.rb

SELECT COUNT(*) FROM `articles`
SELECT `articles`.* FROM `articles` LIMIT 5 OFFSET 0
---
  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)

SELECT `users`.* FROM `users` ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `articles` (`title`, `description`, `created_at`, `updated_at`, `user_id`) VALUES ('この内の「2. 同じバージョンとして記録したいデータを抜きだして登録する」場所のことをインデックスといいます。', 'インデックス\r\nバージョンを記録するためにファイルを一時的に登録する場所です。インデックスに登録されているファイル群の変更が記録されます。つまり、同じバージョンとして記録したい編集についてはまとめてインデックスに追加し、このタイミングでは記録したくない編集についてはインデックスに追加しません。', '2020-11-15 14:54:45', '2020-11-15 14:54:45', 1)
---
  def create
    @article = Article.new(article_params)
    @article.user = User.first
    if @article.save

UPDATE `articles` SET `articles`.`description` = 'Discover interesting projects and people to populate your personal news feed.\r\nYour news feed helps you keep up with recent activity on repositories you watch and people you follow.', `articles`.`updated_at` = '2020-11-15 07:15:36' WHERE `articles`.`id` = 1
---
  def update
    if @article.update(article_params)

DELETE FROM `articles` WHERE `articles`.`id` = 6
---
  def destroy
    @article.destroy