app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)
    if @category.save
---
INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('hellow', '2020-11-26 13:03:07.149328', '2020-11-26 13:03:07.149328')

  def edit
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

  def update
    @category = Category.find(params[:id])
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1

  def index
    @categories =  Category.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM `categories`
SELECT `categories`.* FROM `categories` LIMIT 5 OFFSET 0

  def show
    @category = Category.find(params[:id])
    @articles = @category.articles.paginate(page: params[:page], per_page: 5)
---
SELECT `categories`.* FROM `categories` WHERE `categories`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `articles` INNER JOIN `article_categories` ON `articles`.`id` = `article_categories`.`article_id` WHERE `article_categories`.`category_id` = 1
SELECT COUNT(*) FROM `categories`
SELECT `articles`.* FROM `articles` INNER JOIN `article_categories` ON `articles`.`id` = `article_categories`.`article_id` WHERE `article_categories`.`category_id` = 1 LIMIT 5 OFFSET 0