app/controllers/users_controller.rb

  def show
    @articles = @user.articles.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM `articles` WHERE `articles`.`user_id` = 1
SELECT `articles`.* FROM `articles` WHERE `articles`.`user_id` = 1 LIMIT 5 OFFSET 0

  def index
    @users  = User.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM `users`
SELECT `users`.* FROM `users` LIMIT 5 OFFSET 0

  def update
    if @user.update(user_params)
---
UPDATE `users` SET `users`.`email` = 'aki@ss.com', `users`.`password_digest` = '$2a$12$h5EfiABS8v39mYfEFu8/sucPlmy4j0j.ADrJs.VJbA7Y.GCh.hT6i', `users`.`updated_at` = '2020-11-16 07:13:16.600433' WHERE `users`.`id` = 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('aki2', 'a@oo.com', '2020-11-17 07:26:45.383967', '2020-11-17 07:26:45.383967', '$2a$12$T.doVhE.dtY6LzsOX8eh0.RxegeySC6vz1N0ftt3Y7pOPulrIlm9m')