app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def update
    @user = User.find(params[:id])

INSERT INTO `users` (`username`, `email`, `created_at`, `updated_at`, `password_digest`) VALUES ('aki2', 'aki2aki@example.com', '2020-11-12 13:20:58.481159', '2020-11-12 13:20:58.481159', '$2a$12$iBy1dn8HKrehGngjHfLj9OlAX8qY7v2Eo7XbijqE/wNUPNStQIW76')
---
  def create
    @user = User.new(user_params)
    if @user.save