app/views/categories/index.html.erb

SELECT COUNT(*) FROM `articles` INNER JOIN `article_categories` ON `articles`.`id` = `article_categories`.`article_id` WHERE `article_categories`.`category_id` = 1
---
            <h5 class="card-title"><%= link_to category.name, category_path(category), class: "text-success" %></h5>
            <p class="card-text"><%= pluralize(category.articles.count, "article") %></p>

INSERT INTO `categories` (`name`, `created_at`, `updated_at`) VALUES ('Travel', '2020-11-24 08:11:05.727661', '2020-11-24 08:11:05.727661')
---
          <div class="card-footer text-muted">
            <small>Created <%= time_ago_in_words(category.created_at) %> ago,
            edited <%= time_ago_in_words(category.updated_at) %> ago</small>